src/Catalogs/ПричиныУдалений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПричиныУдалений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПричинУдалений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Списание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводКомментария</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыПричинУдалений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыПричинУдалений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Удаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ПричиныУдалений/Forms/ФормаСписка/module.bsl
Процедура СправочникСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	ОформлениеСтроки.Ячейки.Списание.ОтображатьТекст = Истина;
	
	Если ДанныеСтроки.Тип = Перечисления.ТипыПричинУдалений.Удаление Тогда
		ОформлениеСтроки.Ячейки.Списание.Текст = ?(ДанныеСтроки.Списание, "со списанием", "");
	Иначе
		ОформлениеСтроки.Ячейки.Списание.Текст = ?(ДанныеСтроки.Списание, "с возвратом количества", "");
	КонецЕсли; 
	
	//ОформлениеСтроки.Ячейки.ВводКомментария.ОтображатьТекст = Истина;
	//ОформлениеСтроки.Ячейки.ВводКомментария.Текст = ?(ДанныеСтроки.ВводКомментария, "нужен", "");
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	УправлениеРИБ.ПриОткрытииСпискаСправочника(ЭтаФорма);
	
КонецПроцедуры
